# Taps
tap "oven-sh/bun"
tap "peonping/tap"

# Core CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep-all"
brew "tree"

# Git
brew "gh"
brew "git-quick-stats"
brew "lazygit"

# Editors & shells
brew "neovim"
brew "tmux"

# Languages & runtimes
brew "bun"
brew "cmake"
brew "node"

# Databases
brew "lazysql"
brew "libpq"

# Media
brew "imagemagick"

# Shell tools
brew "atuin"
brew "direnv"
brew "starship"

# Networking
brew "mole"
brew "watchman"

# Misc
brew "hyperfine"
brew "pandoc"
brew "peonping/tap/peon-ping"
brew "pinentry-mac"

# Casks
cask "1password-cli"
